# üêº Pandas Handbook

## 04 - Data Selection

Check out the official [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/)  

This notebook uses the [Ramen Ratings dataset](https://www.kaggle.com/datasets/residentmario/ramen-ratings/data) from Kaggle to demonstrate how to select the data with pandas.

## üìö Table of Contents  
---  

üî¢ **Set & Reset Index**  
üéØ **Select Data by Label or Position**  
üéØ **Select a Single Value**  
üéØ **Select Multiple Rows & Columns**  
‚úÇÔ∏è **Slice the DataFrame**  
üî¢ **Slice by Row Position or Column Name**  
üè∑Ô∏è **Slice by Label with df.loc[]**  
üîç **Select with Conditions**  
üß† **Logical Operators in Pandas**  
üîç **Select with Query**  
üîç **Select with Regex**  
üëâ **Next Topic: Data Cleaning**  

---

In [1]:
import pandas as pd
import os

In [2]:
data_raw = "../data/raw/"
csv_file = "ramen-ratings.csv"
import_path = os.path.join(data_raw, csv_file)
df = pd.read_csv(import_path)

### üî¢ Set & Reset Index

`df.set_index('COLUMN', inplace=True)` ‚Äì Sets the specified `'COLUMN'` as the DataFrame‚Äôs new index.  
`df.reset_index(inplace=True)` ‚Äì Resets the index to default integers and moves the current index back to a column.

In [3]:
df.set_index('Review #', inplace=True)

In [4]:
df.reset_index(inplace=False).head()

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

In [5]:
df.head()

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

### üéØ Select Data by Label or Position

`df.iloc[row_index, column_index]` ‚Äì Selects data by **integer position** for rows and columns.  
`df.iat[row_index, column_index]` ‚Äì Accesses a **single value** by position.  
`df.loc[index_label, column_label]` ‚Äì Selects data by **label** for index and columns.  
`df.at[index_label, column_label]` ‚Äì Accesses a **single value** by label.

Use `df.loc[]` and `df.iloc[]` to select rows and columns by label or position.  
Use `df.at[]` and `df.iat[]` for fast access to a single value.

`df.iloc[[row1, row2], [col1, col2]]` ‚Äì Selects specific rows and columns by **position**.  
`df.loc[[index_label1, index_label2], ['col1', 'col2']]` ‚Äì Selects specific index and columns by **label**.

#### üéØ Select a Single Value

Locating data by integer position `[row, column]`

In [6]:
df.iloc[0, 0]

'New Touch'

In [7]:
df.iat[0, 0]

'New Touch'

Locating data by index and column name `[index, column_name]`

In [8]:
df.loc[2580, 'Variety']

"T's Restaurant Tantanmen "

In [9]:
df.at[2580, 'Variety']

"T's Restaurant Tantanmen "

#### üéØ Select Multiple Rows & Columns

Select multiple rows and columns using index lists with `.iloc[]` or `.loc[]`.

In [10]:
df.iloc[[0, 1], [0,1,2]]

              Brand                                            Variety Style
Review #
2580      New Touch                          T's Restaurant Tantanmen    Cup
2579       Just Way  Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...  Pack

In [11]:
df.loc[[2580, 2579], ['Brand', 'Variety', 'Style']]

              Brand                                            Variety Style
Review #
2580      New Touch                          T's Restaurant Tantanmen    Cup
2579       Just Way  Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...  Pack

### ‚úÇÔ∏è Slice the DataFrame

#### üî¢ Slice by Row Position or Column Name
Use Python slicing syntax to select ranges of rows or columns.

`df[start:stop]` ‚Äì Slices rows by position (stop is exclusive).  
`df['COLUMN']` ‚Äì Selects a single column by name (returns a Series).  
`df[['COLUMN_1', 'COLUMN_2']]` ‚Äì Selects multiple columns by name.  
`df.get(['COLUMN_1', 'COLUMN_1'])` ‚Äì Selects safely multiple columns by name.  
`df.COLUMN` ‚Äì Dot notation for selecting a column (if name is a valid Python identifier).

In [12]:
df[10:13]

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2570,Tao Kae Noi,Creamy tom Yum Kung Flavour,Pack,Thailand,5,NaN
2569,Yamachan,Yokohama Tonkotsu Shoyu,Pack,USA,5,NaN
2568,Nongshim,Mr. Bibim Stir-Fried Kimchi Flavor,Pack,South Korea,4.25,NaN

In [13]:
df['Country'].head()

Review #
2580     Japan
2579    Taiwan
2578       USA
2577    Taiwan
2576     India
Name: Country, dtype: object

In [14]:
df[['Brand', 'Variety', 'Style']].head()

,Brand,Variety,Style
Review #,,,
2580,New Touch,T's Restaurant Tantanmen,Cup
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack
2578,Nissin,Cup Noodles Chicken Vegetable,Cup
2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack
2576,Ching's Secret,Singapore Curry,Pack

In [15]:
df.get(['Brand', 'Variety', 'Style']).head()

,Brand,Variety,Style
Review #,,,
2580,New Touch,T's Restaurant Tantanmen,Cup
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack
2578,Nissin,Cup Noodles Chicken Vegetable,Cup
2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack
2576,Ching's Secret,Singapore Curry,Pack

In [16]:
df.Country.head()

Review #
2580     Japan
2579    Taiwan
2578       USA
2577    Taiwan
2576     India
Name: Country, dtype: object

#### üè∑Ô∏è Slice by Label with `df.loc[]`
Use `.loc[]` with labels to slice rows or columns. **Note: The end index is inclusive.**

`df.loc[start_label:end_label, 'COLUMN_1':'COLUMN_3']` ‚Äì Slices rows and columns by label.  
`df.loc[:, ['COLUMN_1', 'COLUMN_2']]` ‚Äì Selects all rows, and specific columns by name.

In [17]:
df.loc[2580:2579, 'Brand': 'Style']

              Brand                                            Variety Style
Review #
2580      New Touch                          T's Restaurant Tantanmen    Cup
2579       Just Way  Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...  Pack

In [18]:
df.loc[:, ['Brand', 'Variety', 'Style']].head(3)

              Brand                                            Variety Style
Review #
2580      New Touch                          T's Restaurant Tantanmen    Cup
2579       Just Way  Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...  Pack
2578         Nissin                      Cup Noodles Chicken Vegetable   Cup

### üîç Select with Conditions

`df.loc[:, df.columns.str.contains('pattern')]` ‚Äì Selects all columns whose name matches the regex `'pattern'`.  
`df[df['COLUMN'].isin(['VALUE_1', 'VALUE_2'])]` ‚Äì Filters rows where the column value is in the given list.   
`df[df['COLUMN'] == 'VALUE']` ‚Äì Selects rows where the specified column matches the condition.    
`df[df['COLUMN'] > NUM]` ‚Äì Filters rows based on numeric comparison.

In [19]:
df.loc[:, df.columns.str.contains('y')].head()

                                                    Variety Style Country
Review #
2580                              T's Restaurant Tantanmen    Cup   Japan
2579      Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...  Pack  Taiwan
2578                          Cup Noodles Chicken Vegetable   Cup     USA
2577                          GGE Ramen Snack Tomato Flavor  Pack  Taiwan
2576                                        Singapore Curry  Pack   India

In [20]:
df[df['Country'].isin(['Japan', 'South Korea'])].head()

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
2575,Samyang Foods,Kimchi song Song Ramen,Pack,South Korea,4.75,NaN
2574,Acecook,Spice Deli Tantan Men With Cilantro,Cup,Japan,4,NaN
2573,Ikeda Shoku,Nabeyaki Kitsune Udon,Tray,Japan,3.75,NaN
2572,Ripe'n'Dry,Hokkaido Soy Sauce Ramen,Pack,Japan,0.25,NaN

In [21]:
brand_yamachan = df[df['Brand'] == 'Yamachan']
brand_yamachan.head()

             Brand                  Variety Style Country Stars Top Ten
Review #
2569      Yamachan  Yokohama Tonkotsu Shoyu  Pack     USA     5     NaN
2563      Yamachan        Tokyo Shoyu Ramen  Pack     USA     5     NaN
2557      Yamachan       Sapporo Miso Ramen  Pack     USA  4.75     NaN
936       Yamachan            Mild Tonkotsu  Pack     USA     5     NaN
889       Yamachan         Rich Shoyu Ramen  Pack     USA     4     NaN

In [22]:
brand_yamachan[brand_yamachan['Stars'].astype(float) > 4.5]

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2569,Yamachan,Yokohama Tonkotsu Shoyu,Pack,USA,5,NaN
2563,Yamachan,Tokyo Shoyu Ramen,Pack,USA,5,NaN
2557,Yamachan,Sapporo Miso Ramen,Pack,USA,4.75,NaN
936,Yamachan,Mild Tonkotsu,Pack,USA,5,NaN
886,Yamachan,Tonkotsu-Shoyu Rich Pork Flavor¬†Ramen,Pack,USA,4.75,NaN
885,Yamachan,Miso Ramen Rich Sapporo Miso,Pack,USA,5,NaN

### üß† Logical Operators in Pandas
Use these operators in combination with boolean masks or inside `.query()`.

`<` ‚Äì Less than  
`>` ‚Äì Greater than  
`==` ‚Äì Equals  
`<=` ‚Äì Less than or equals  
`>=` ‚Äì Greater than or equals  
`!=` ‚Äì Not equal to  
`&` ‚Äì And  
`|` ‚Äì Or  
`~` ‚Äì Not

### üîç Select with Query

`df.query("COLUMN == 'VALUE' and COLUMN > num")` ‚Äì Filters rows using a SQL-like expression with improved readability.  
`df.query("COLUMN in ['VALUE_1', 'VALUE_2']")` ‚Äì Filters rows where the column matches a list of values.

In [23]:
query_df = df.copy()
query_df['Stars'] = query_df['Stars'].replace('Unrated', 0).astype(float)

In [24]:
query_df.query("Country == 'Japan' and Stars >= 4.5").head()

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2567,Nissin,Deka Buto Kimchi Pork Flavor,Bowl,Japan,4.50,NaN
2553,Nissin,Hakata Ramen Noodle White Tonkotsu,Bowl,Japan,4.75,NaN
2532,Nissin,Nippon Onomichi Ramen,Bowl,Japan,4.75,NaN
2529,Maruchan,Gotsumori Chanpon Ramen,Bowl,Japan,4.50,NaN
2522,Takamori,Hearty Japanese Style Curry Udon,Pack,Japan,5.00,NaN

In [25]:
query_df.query("Country in ['Japan', 'Taiwan']").head()

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00,NaN
2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
2574,Acecook,Spice Deli Tantan Men With Cilantro,Cup,Japan,4.00,NaN
2573,Ikeda Shoku,Nabeyaki Kitsune Udon,Tray,Japan,3.75,NaN

### üîç Select with Regex

`df.filter(regex='pattern')` ‚Äì Selects columns whose names match the given regular expression.

In [26]:
df.filter(regex='C').head()

         Country
Review #
2580       Japan
2579      Taiwan
2578         USA
2577      Taiwan
2576       India

### üëâ Next Topic: [Data Cleaning](./05-data-cleaning.ipynb)

Learn how to clean data with pandas.